title: Scheduled Task Creation from Suspicious Source
id: 0dfb4b82-f671-43bd-971b-913f3f1d529c
description: Detects scheduled task creation from phishing malware persistence technique
status: experimental
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: 'schtasks.exe'
    CommandLine|contains|all:
      - '/create'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
falsepositives:
  - Admin scripts
level: high
tags:
  - attack.t1053.005
